Show / Hide Table of Contents
Class SectionResultOnPoints
Section result of points
Inheritance
System.Object
SectionResultBase
SectionResultOnPoints
Inherited Members
 SectionResultBase.Loading
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class SectionResultOnPoints : SectionResultBase
Constructors
Improve this Doc   View Source
SectionResultOnPoints()
Constructor
Declaration
public SectionResultOnPoints()
Properties
Improve this Doc   View Source
Points
Section points
Declaration
public List<PointResults> Points { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PointResults>
 Improve this Doc
 View Source